In [1]:
#dtata wrangling
import pandas as pd
import numpy as np
from numpy.random import randn
from pandas import DataFrame, read_csv
import sys

# Series

In [8]:
sys.version

'3.7.3 (default, Mar 27 2019, 17:13:21) [MSC v.1915 64 bit (AMD64)]'

In [9]:
pd.__version__

'0.24.2'

In [11]:
s=pd.Series()
s

Series([], dtype: float64)

In [21]:
a=np.array([0,10,23,4])
pd.Series(a,index=['a','b','c','d'],copy=True,name='Table')

a     0
b    10
c    23
d     4
Name: Table, dtype: int32

In [22]:
d={'a':0,'b':1}
pd.Series(d)

a    0
b    1
dtype: int64

In [2]:
pd.Series([1,2,np.nan,4])

0    1.0
1    2.0
2    NaN
3    4.0
dtype: float64

In [3]:
l=['a','b','c']
n=[1,2,3]
a=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [10]:
pd.Series(a,l)

a    10
b    20
c    30
dtype: int32

In [17]:
l=['a','b','c','f']
l1=['a','b','d','g']
i=[1,2,3,4]
i1=[1,2,4,5]
s=pd.Series(l,i)
s1=pd.Series(l1,i1)
s+s1

1     aa
2     bb
3    NaN
4     fd
5    NaN
dtype: object

# Data Frame

In [4]:
np.random.seed(101)

In [4]:
df=pd.DataFrame(randn(5,4),index='a b c d e'.split(),columns='f g h j'.split())
df

          f         g         h         j
a  0.346506  0.474272 -0.551822  0.756930
b -0.953414  0.102323  0.303111 -0.552145
c  1.292452  0.958350  0.034309 -0.743250
d -0.023965  0.120353  0.535011  0.305326
e -0.049415 -0.151585  0.775895 -0.245734

In [40]:
df[['f','g']]

          f         g
a -1.409126  0.870907
b -0.550876  0.942045
c  2.165421 -1.267240
d  0.090699  1.321715
e  0.771970  0.294217

In [66]:
df['m']=df['f']+2
df

          f         g         h         j         m
a  0.590874  0.870907  1.585812  0.929658  2.590874
b  1.449124  0.942045 -0.975349 -1.054851  3.449124
c  4.165421 -1.267240 -0.802843 -0.253479  6.165421
d  2.090699  1.321715  0.794129  1.359712  4.090699
e  2.771970  0.294217 -1.391519  0.147486  4.771970

1=colunm
0=rows

In [68]:
df.drop('m',axis=1,inplace=True)
df

          f         g         h         j
a  0.590874  0.870907  1.585812  0.929658
b  1.449124  0.942045 -0.975349 -1.054851
c  4.165421 -1.267240 -0.802843 -0.253479
d  2.090699  1.321715  0.794129  1.359712
e  2.771970  0.294217 -1.391519  0.147486

In [87]:
df.loc['a':'d']#inddex name

          f         g         h         j
a  0.590874  0.870907  1.585812  0.929658
b  1.449124  0.942045 -0.975349 -1.054851
c  4.165421 -1.267240 -0.802843 -0.253479
d  2.090699  1.321715  0.794129  1.359712

In [88]:
df.iloc[0:3]#index

          f         g         h         j
a  0.590874  0.870907  1.585812  0.929658
b  1.449124  0.942045 -0.975349 -1.054851
c  4.165421 -1.267240 -0.802843 -0.253479

In [89]:
df.iloc[0,3]

0.9296578406361021

In [90]:
df.iloc[[0,3]]

          f         g         h         j
a  0.590874  0.870907  1.585812  0.929658
d  2.090699  1.321715  0.794129  1.359712

In [91]:
df.iloc[[0,2],[1,3]]

          g         j
a  0.870907  0.929658
c -1.267240 -0.253479

In [92]:
df>0#boolean fun

      f      g      h      j
a  True   True   True   True
b  True   True  False  False
c  True  False  False  False
d  True   True   True   True
e  True   True  False   True

In [93]:
df.reset_index()#reset index

  index         f         g         h         j
0     a  0.590874  0.870907  1.585812  0.929658
1     b  1.449124  0.942045 -0.975349 -1.054851
2     c  4.165421 -1.267240 -0.802843 -0.253479
3     d  2.090699  1.321715  0.794129  1.359712
4     e  2.771970  0.294217 -1.391519  0.147486

In [140]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [127]:
df.dropna()#droping nan

     A    B  C
0  1.0  5.0  1

In [128]:
df.dropna(thresh=1,axis=1)#keep tht rows/columns with 1 nan value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [129]:
df.dropna(axis=1)#drop columns contnaing nan

   C
0  1
1  2
2  3

In [136]:
df.fillna(value=3,inplace=True)
df

     A    B  C
0  1.0  5.0  1
1  2.0  3.0  2
2  3.0  3.0  3

In [131]:
df.fillna(value=df.mean(axis=0))
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [141]:
df['A'].fillna(value=2,inplace=True)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  2.0  NaN  3

# GroupBy

In [5]:
d={'Company':['IBM','IBM','FB','FB','Inst','Inst'],'Person':['Rishav','Asif','Chirag','Nikhil','Avinash','Ayush'],
  'Sales':[200,100,130,140,120,150]}

In [6]:
df=pd.DataFrame(d)
df

  Company   Person  Sales
0     IBM   Rishav    200
1     IBM     Asif    100
2      FB   Chirag    130
3      FB   Nikhil    140
4    Inst  Avinash    120
5    Inst    Ayush    150

In [79]:
a=df.groupby('Company')
a

In [13]:
a.mean()

         Sales
Company
FB         135
IBM        150
Inst       135

In [18]:
a.max()

         Person  Sales
Company
FB       Nikhil    140
IBM      Rishav    200
Inst      Ayush    150

In [15]:
a.count()

         Person  Sales
Company
FB            2      2
IBM           2      2
Inst          2      2

In [16]:
df.count()

Company    6
Person     6
Sales      6
dtype: int64

In [19]:
a.std()

             Sales
Company
FB        7.071068
IBM      70.710678
Inst     21.213203

In [20]:
df.describe()

            Sales
count    6.000000
mean   140.000000
std     34.058773
min    100.000000
25%    122.500000
50%    135.000000
75%    147.500000
max    200.000000

In [21]:
a.describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        2.0  135.0   7.071068  130.0  132.5  135.0  137.5  140.0
IBM       2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
Inst      2.0  135.0  21.213203  120.0  127.5  135.0  142.5  150.0

In [24]:
#top 5 data
df.head()

  Company   Person  Sales
0     IBM   Rishav    200
1     IBM     Asif    100
2      FB   Chirag    130
3      FB   Nikhil    140
4    Inst  Avinash    120

In [27]:
df['Company'].unique()

array(['IBM', 'FB', 'Inst'], dtype=object)

In [7]:
#select from dataFrame using criteria from multiple colunms
nw=[df['Company']=='IBM']
nw

[0     True
 1     True
 2    False
 3    False
 4    False
 5    False
 Name: Company, dtype: bool]

In [93]:
def terms(x):
    x*2

In [96]:
df['Sales'].apply(len)

TypeError: object of type 'int' has no len()